app/views/newsfeed/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  <tr>
    <td><%= User.find(newsfeed.user_id).email%></td>