app/views/friendship/index.html.erb

    <%= f.hidden_field :user_id, :value => @user.id %>
    <%= f.hidden_field :friend_id, :value => User.find_by_email(friend.email).id %>
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'rapaellk@nate.com' LIMIT 1