app/views/posts/show.html.erb

<tr>
  <td><%= User.find(@post.user_id).email %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

    <div>
      <%= image_tag Image.find(@post.image_id).local %>
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 2]]