app/controllers/friendship_controller.rb

  def find_and_require
    @req_friend = FriendReq.new(friend_req_params)
    if @req_friend.save
---
INSERT INTO "friend_reqs" ("created_at", "friend_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Nov 2013 23:56:06 UTC +00:00], ["friend_id", 1], ["updated_at", Tue, 19 Nov 2013 23:56:06 UTC +00:00], ["user_id", 4]]

  def allow
    @friendship = Friendship.new(allow_params)
    req_friend_delete = FriendReq.where(user_id: @friendship.friend_id, friend_id: @friendship.user_id).first
    if req_friend_delete.destroy
      friendship_reverse = Friendship.create(user_id: @friendship.friend_id,friend_id: @friendship.user_id)
---
SELECT "friend_reqs".* FROM "friend_reqs" WHERE "friend_reqs"."user_id" = 4 AND "friend_reqs"."friend_id" = 1 ORDER BY "friend_reqs"."id" ASC LIMIT 1
DELETE FROM "friend_reqs" WHERE "friend_reqs"."id" = ?  [["id", 3]]
INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 20 Nov 2013 01:03:02 UTC +00:00], ["friend_id", 4], ["updated_at", Wed, 20 Nov 2013 01:03:02 UTC +00:00], ["user_id", 1]]