app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY updated_at DESC  [["user_id", 1]]
---
  def index
    @posts = @user.posts.order('updated_at DESC')

INSERT INTO "images" ("created_at", "local", "original_name", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "posts" ("content", "created_at", "image_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "ddd"], ["created_at", Wed, 20 Nov 2013 09:30:50 UTC +00:00], ["image_id", 2], ["updated_at", Wed, 20 Nov 2013 09:30:50 UTC +00:00], ["user_id", 4]]
---
  def create
    @post = Post.new
    params_f = posts_params
    uploaded_io = params_f[:image]
    image_id = nil
    if(uploaded_io)
      im = uploaded_io.read
      correct_img = image_type(im[0,10])
      if correct_img == 'etc'
        render action: 'new'
        return false
      end
      path = Rails.root.join('app','assets','images','photos', @user.id.to_s).to_s
      #dirname = File.dirname(path)
      unless File.directory?(path)
        FileUtils.mkdir_p(path)
      end
      filename = SecureRandom.urlsafe_base64+"_"+uploaded_io.original_filename
      File.open(path+"/"+filename,'wb') do |file|
        file.write(im)
      end
      image_rec = Image.create(original_name: uploaded_io.original_filename, local: '/assets/photos/'+@user.id.to_s+"/"+filename)
      image_rec.save
      image_id = image_rec.id
    end
    @post = Post.create(user_id: posts_params[:user_id], content: posts_params[:content], image_id: image_id)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = ? AND "users"."friend_id" = 1 LIMIT 1  [["user_id", 1]]
---
  def show
    @permission = false
    @post = Post.find(params[:id])
    if @post.user_id == @user.id or @user.friends.exists?(id: @post.user_id)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 5]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.image_id
      image = Image.find(@post.image_id)
      image.destroy