app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'rapaellk@naver.com' LIMIT 1
UPDATE "users" SET "session_id" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["session_id", "cmFwYWVsbGtAbmF2ZXIuY29t\n"], ["updated_at", Tue, 19 Nov 2013 10:57:18 UTC +00:00]]
---
  def create
    user = User.find_by_email(params[:email])
    if user and user.hashed_password == Base64.encode64(params[:password])
      session[:user_id] = user.id
      session[:user_email]= user.email
      #session[:session_string]= user.session_id
      session[:user_name]=user.name
      user.session_id = session[:session_id]
      user.save