app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "hashed_password", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 19 Nov 2013 09:43:13 UTC +00:00], ["email", "rapaellk@naver.com"], ["hashed_password", "NDQ4NTI4N2s=\n"], ["name", "aaa"], ["updated_at", Tue, 19 Nov 2013 09:43:13 UTC +00:00]]

  def edit
    @permission = false
    if @user.id == params[:id].to_f
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @user = User.find(params[:id])
    if(@user.update(user_params))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "김태훈"], ["updated_at", Wed, 20 Nov 2013 10:48:02 UTC +00:00]]